### Slice operation on rows

In [ ]:
import numpy as np
import pandas as pd
a = np.arange(2,26).reshape(6,4)
df = pd.DataFrame(a,columns=['A','B','C','D'])
df

    A   B   C   D
0   2   3   4   5
1   6   7   8   9
2  10  11  12  13
3  14  15  16  17
4  18  19  20  21
5  22  23  24  25

In [ ]:
df[1:3]

    A   B   C   D
1   6   7   8   9
2  10  11  12  13

In [ ]:
df[:-2]

    A   B   C   D
0   2   3   4   5
1   6   7   8   9
2  10  11  12  13
3  14  15  16  17

### Slice operation on column

In [ ]:
df['A'][:3]

0     2
1     6
2    10
Name: A, dtype: int64

### Addition using append

In [ ]:
import pandas as pd
df1 = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])
df1,df2

(   a  b
 0  1  2
 1  3  4,
    a  b
 0  5  6
 1  7  8)

In [ ]:
#Append rows of `other` to the end of caller, returning a new object
df1.append(df2)

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [ ]:
df1.append(df2,ignore_index=True)

   a  b
0  1  2
1  3  4
2  5  6
3  7  8

In [ ]:
df1 = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','c'])
df1,df2

(   a  b
 0  1  2
 1  3  4,
    a  c
 0  5  6
 1  7  8)

In [ ]:
df1.append(df2)

   a    b    c
0  1  2.0  NaN
1  3  4.0  NaN
0  5  NaN  6.0
1  7  NaN  8.0

### Delete row using drop

In [ ]:
df

   a  b
0  1  2
1  3  4

In [ ]:
'''df.drop(
            labels=None,
            axis=0,
            index=None,
            columns=None,
            level=None,
            inplace=False,
        )
'''
# axis = 0 means row/index
#axis = 1 means column

In [ ]:
df

   a  b
0  1  2
1  3  4

In [ ]:
df.drop(labels=0)   
# here default axis=0 means row

   a  b
1  3  4

In [ ]:
df.drop(labels='b',axis=1)

   a
0  1
1  3

In [ ]:
#directly i want to remove a perticular column
df.drop(columns='a')

   b
0  2
1  4

In [ ]:
#when we want to drop row
df.drop(index=0)

   a  b
1  3  4

In [ ]:
#1. i want to drop multiple rows
#2. i want to drop mutiple columns

In [ ]:
import numpy as np
pd.DataFrame(np.arange(1,21).reshape(5,4),columns=list('abcd'))

    a   b   c   d
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20

### Delet column using label and axis=1

In [ ]:
df.drop('a',axis=1) # OR df.drop(labels='b',axis=1)
#axis=1 means column

### Delet column using columns attribute

In [ ]:
df.drop(columns='b')

   a
0  1
1  3

# Simplest way to directly create DataFrame is

In [ ]:
import numpy as np
df = pd.DataFrame(np.arange(12).reshape(3,4))
df

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11